MinorCSE/Re2800_kOmega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       41710;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       41850;
    }
    inlet_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          75;
        startFace       41990;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet_half0;
    }
    inlet_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          75;
        startFace       42065;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet_half1;
    }
    outlet_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          75;
        startFace       42140;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet_half0;
    }
    outlet_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          75;
        startFace       42215;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet_half1;
    }
    sideRight_half0
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10500;
        startFace       42290;
    }
    sideRight_half1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10500;
        startFace       52790;
    }
    sideLeft_half0
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10500;
        startFace       63290;
    }
    sideLeft_half1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10500;
        startFace       73790;
    }
)

// ************************************************************************* //
